<?php

<<<<<<< HEAD
$textbotlang = json_decode(file_get_contents("/www/wwwroot/{$_SERVER['SERVER_NAME']
}/text.json"), true);
=======

$textbotlang['users']['Rules'] = "✅ قوانین تایید شد از الان می توانید از خدمات ربات استفاده نمایید.";
$textbotlang['users']['back'] = "به صفحه اصلی بازگشتید!";
$textbotlang['users']['backorder'] = "🏠 بازگشت به اطلاعات سرویس";
$textbotlang['users']['spamtext'] = "اسپم در ربات";
$textbotlang['users']['online'] = "آنلاین";
$textbotlang['users']['offline'] = "آفلاین";
$textbotlang['users']['unlimited'] = "نامحدود";


$textbotlang['users']['number']['false'] = "❌ شماره تلفن صحبح نیست شماره تلفن صحبح را ارسال نمایید.";
$textbotlang['users']['number']['Warning'] = "⚠️ خطا در ذخیره سازی شماره تلفن، شماره باید حتما برای همین اکانت باشد";
$textbotlang['users']['number']['erroriran'] = "⭕️ شماره موبایل نامعتبر است. فقط شماره های ایرانی مورد قبول می باشد";
$textbotlang['users']['number']['active'] = "✅ شماره موبایل شما با موفقیت تایید شد";
$textbotlang['users']['number']['Confirming'] = "📞 لطفا شماره موبایل خود را  برای احراز هویت ارسال نمایید";


$textbotlang['users']['sell']['service_not_available'] = "⛔️ شما هیچ سرویس فعالی ندارید";
$textbotlang['users']['sell']['service_sell'] = "🛍 اشتراک های خریداری شده توسط شما
    ⚜️برای مشاهده اطلاعات روی نام کاربری کلیک کنید";
$textbotlang['users']['sell']['Service-select'] = "🛒 لوکیشن دریافت شد سرویسی که میخواهید خریداری کنید را انتخاب نمایید.";
$textbotlang['users']['sell']['Service-Location'] = "❌ خطا 
        📝 موقعیت سرویس نامعتبر است";
$textbotlang['users']['sell']['error-product'] = "❌ خطا 
        📝 محصول انتخابی وجود ندارد";
$textbotlang['users']['sell']['None-credit'] = "🚨 خطایی در هنگام پرداخت رخ داده است.
📝 دلیل خطا: موجودی حساب کاربری شما کافی نمی باشد ابتدا باید حساب خود را شارژ کنید

❌ برای شارژ حساب کاربری خود یکی از روش های پرداخت زیر را انتخاب کنید";
$textbotlang['users']['sell']['ErrorConfig'] = "❌ خطایی در ساخت اشتراک رخ داده است برای رفع مشکل با پشتیبانی در ارتباط باشد.";
$textbotlang['users']['sell']['selectpayment'] = "📌 یک روش پرداخت از لیست بالا انتخاب نمایید";


$textbotlang['users']['stateus']['notUsername'] = "⭕️ کاربر عزیز در صورتی که نام کاربری  شما در لیست بالا وجود ندارد. دکمه زیر را کلیک کنید.";
$textbotlang['users']['stateus']['notUsernameget'] = "نام کاربری وجود ندارد";
$textbotlang['users']['stateus']['SendUsername'] = "نام کاربری خود را ارسال نمایید";
$textbotlang['users']['stateus']['active'] = "✅ فعال";
$textbotlang['users']['stateus']['limited'] = "🚫 پایان حجم";
$textbotlang['users']['stateus']['onhold'] = "⏳ متصل نشده";
$textbotlang['users']['stateus']['disabled'] = "❌ غیرفعال";
$textbotlang['users']['stateus']['expired'] = "🔚 پایان زمان سرویس";
$textbotlang['users']['stateus']['Unlimited'] = "نامحدود";
$textbotlang['users']['stateus']['day'] = "روز";
$textbotlang['users']['stateus']['Notconsumed'] = "مصرف نشده";
$textbotlang['users']['stateus']['username'] = "نام کاربری : ";
$textbotlang['users']['stateus']['stateus'] = "وضعیت:";
$textbotlang['users']['stateus']['expirationDate'] = "زمان پایان:";
$textbotlang['users']['stateus']['daysleft'] = "زمان باقی مانده سرویس:";
$textbotlang['users']['stateus']['usedTrafficGb'] = "حجم مصرف شده سرویس:";
$textbotlang['users']['stateus']['LastTraffic'] = "حجم کل سرویس :";
$textbotlang['users']['stateus']['RemainingVolume'] = "حجم باقی مانده سرویس :";
$textbotlang['users']['stateus']['info'] = "📊 اطلاعات سرویس:";
$textbotlang['users']['stateus']['error'] = "❌خطایی رخ داده است";
$textbotlang['users']['stateus']['usernotfound'] = " ❌ کاربر در سرور وجود ندارد";
$textbotlang['users']['stateus']['getlinksub'] = "🔗  دریافت لینک اشتراک";
$textbotlang['users']['stateus']['linksub'] = "🔗 لینک اشتراک";
$textbotlang['users']['stateus']['backlist'] = "🏠 بازگشت به لیست سرویس ها";
$textbotlang['users']['stateus']['backservice'] = "🏠 بازگشت به مشخصات سرویس";
$textbotlang['users']['stateus']['Invalidusername'] = "❌ نام کاربری نامعتبر است.
🔄 مجددا نام کاربری خود را ارسال کنید";
$textbotlang['users']['stateus']['manageService'] = "⚙️ تنظیمات سرویس";
$textbotlang['users']['stateus']['DecManageService '] = "⭕️ در این بخش می توانید سرویس خود را مدیریت کنید";
$textbotlang['users']['stateus']['config'] ="🔰 کانفیگ دستی";
$textbotlang['users']['stateus']['notconnected'] ="متصل نشده";


$textbotlang['users']['extend']['title'] ="📌 تمدید سرویس";
$textbotlang['users']['extend']['confirm'] = "تایید تمدید";
$textbotlang['users']['extend']['thanks'] = "با تشکر از تمدید سرویس خود🙏

⭕️تمدید شما با موفقیت انجام شد با تشکر از پرداخت شما
 
⬅️ برای بازگشت به لیست سرویس های خود یا مشاهده اطلاعات روی دکمه های زیر کلیک کنید";
$textbotlang['users']['extend']['error'] = "❌ خطایی رخ داده است برای رفع مشکل با پشتیبانی در ارتباط باشید";
$textbotlang['users']['extend']['selectservice'] = " 🛍 محصول خود را برای تمدید انتخاب نمایید";



$textbotlang['users']['Extra_volume']['SetPrice'] = "⭕️ قیمتی که می خواهید برای هرگیگ حجم اضافه تعیین کنید را ارسال کنید.
قیمت فعلی :";
$textbotlang['users']['Extra_volume']['ChangedPrice'] = "✅ مبلغ با موفقیت ذخیره گردید.";
$textbotlang['users']['Extra_volume']['sellextra'] = "➕ خرید حجم اضافه";
$textbotlang['users']['Extra_volume']['extraadded'] = "✅ حجم با موفقیت به سرویس شما اضافه گردید.";
$textbotlang['users']['Extra_volume']['extracheck'] = "تایید و دریافت حجم اضافه";
$textbotlang['users']['Extra_volume']['invalidprice'] = "حداقل حجم 1 گیگابایت می باشد";

$textbotlang['users']['usertest']['limitwarning'] = "⚠️ محدودیت ساخت اشتراک تست شما به پایان رسید.";
$textbotlang['users']['usertest']['errorcreat'] = "❌ خطایی در ساخت اشتراک رخ داده است برای رفع مشکل با پشتیبانی در ارتباط باشد.";
$textbotlang['users']['usertest']['iduser'] = "آیدی عددی کاربر";
$textbotlang['users']['usertest']['phonenumber'] = "شماره تلفن کاربر";
$textbotlang['users']['usertest']['namepanel'] = "نام پنل";




$textbotlang['users']['help']['disablehelp'] = "کاربر گرامی بخش آموزش درحال حاضر غیرفعال است. 😔";
$textbotlang['users']['help']['btninlinebuy'] = "📚 مشاهده آموزش استفاده ";


$textbotlang['users']['support']['sendmessageadmin'] = "🚀 پیام شما ارسال شد منتظر پاسخ مدیریت باشید";
$textbotlang['users']['support']['answermessage'] = "پاسخ به پیام";
$textbotlang['users']['support']['sendmessageuser'] = "📨 برای ارتباط با پشتیبانی پیام خود را ارسال کنید";
$textbotlang['users']['support']['btnsupport'] = "☎️  در دکمه زیر ( سوالات متداول ) سوالات پرتکرار شما آمده است. روی دکمه زیر کلیک کنید در صورت نیافتن سوال خود روی دکمه پشتیبانی کلیک کنید";


$textbotlang['users']['Balance']['priceinput'] = "💸 مبلغ را  به تومان وارد کنید:
✅ حداکثر مبلغ 10.000.000میلیون تومان می باشد";
$textbotlang['users']['Balance']['errorprice'] = "❌ خطا 
💬 لطفا فقط عدد وارد کنید
اعداد به صورت لاتین (کیبورد روی انگلیسی) باشد";
$textbotlang['users']['Balance']['errorpricelimit'] = "❌ خطا 
        💬 مبلغ باید کمتر 10 میلیون تومان و بیشتر از 20 هزار تومان باشد";
$textbotlang['users']['Balance']['selectPatment'] = "💵 روش پرداخت خود را انتخاب نمایید";
$textbotlang['users']['Balance']['nowpayments'] = "❌ خطا 
    کمترین مبلغ برای  پرداخت در این درگاه 1 دلار می باشد.";
$textbotlang['users']['Balance']['zarinpal'] = "❌ خطا 
    کمترین مبلغ برای  پرداخت در این درگاه 5000 تومان می باشد.";
$textbotlang['users']['Balance']['linkpayments'] = "درحال ساخت لینک پرداخت...";
$textbotlang['users']['Balance']['payments'] = "پرداخت";
$textbotlang['users']['Balance']['changeto'] = "❌ خطا 
    کمترین مبلغ برای  پرداخت در این درگاه 2 ترون می باشد";
$textbotlang['users']['Balance']['errorLinkPayment'] = "❌ خطایی در ساخت لینک پرداخت رخ داده است برای رفع  با پشتیبانی در ارتباط باشید.";
$textbotlang['users']['Balance']['reject_pay']  = "❌ رد پرداخت";
$textbotlang['users']['Balance']['Confirmpayadmin']  = "⭕️  پرداخت از قبل تایید شده است";
$textbotlang['users']['Balance']['finished'] = "پزداخت شما با موفقیت تایید شد";
$textbotlang['users']['Balance']['sending'] = "پرداخت دریافت شده و درحال بررسی می باشد لطفا منتظر بمانید";
$textbotlang['users']['Balance']['expired'] = "زمان لینک پرداخت منقضی شده و قابل بررسی نیست";
$textbotlang['users']['Balance']['refunded'] = "مبلغ به کیف پول شما بازگشته است";
$textbotlang['users']['Balance']['waiting'] = "در انتظار تایید پرداخت";
$textbotlang['users']['Balance']['Failed'] = "⭕️ پرداخت شما تایید نگردیده است";
$textbotlang['users']['Balance']['Confirmpay']  = "✅ کاربر گرامی پرداخت شما با موفقیت انجام شد و مبلع پرداختی به موجودی شما اضافه گردید";
$textbotlang['users']['Balance']['Invalid-receipt'] = "رسید نامعتبر است رسید باید فقط عکس باشد";
$textbotlang['users']['Balance']['Confirmpaying']  = "✅ تایید پرداخت";
$textbotlang['users']['Balance']['Send-receipt'] ="🚀 رسید پرداخت  شما ارسال شد پس از تایید توسط مدیریت مبلغ به کیف پول شما واریز خواهد شد";



$textbotlang['users']['changelink']['btntitle'] = "⚙️ بروزرسانی اشتراک ";
$textbotlang['users']['changelink']['warnchange'] = "⚠️ در صورت بروزرسانی لینک اشتراک کانفیگ ها سرویس شما قطع شده و باید از بخش تنظیمات سرویس کانفیگ یا لینک اشتراک جدید را دریافت کنید.";
$textbotlang['users']['changelink']['confirm'] = "تغییر لینک اتصال";
$textbotlang['users']['changelink']['confirmed'] = "✅ لینک اتصال شما بروزرسانی و کانفیگ قبلی قطع گردید برای دریافت کانفیگ جدید منوی تنظمیات سرویس مراجعه کرده و کانفیگ جدید را تهیه کنید.";



$textbotlang['users']['removeconfig']['btnremoveuser'] = "💸 بازگشت وجه ";
$textbotlang['users']['removeconfig']['rejectremove'] = "❌عدم تایید حذف";
$textbotlang['users']['removeconfig']['accepetrequest'] = "✅ درخواست شما ارسال گردید پس از بررسی مدیریت نتیجه به شما اطلاع رسانی خواهد شد";
$textbotlang['users']['stateus']['notusername'] = "❌ امکان حذف سرویس وجود ندارد.";
$textbotlang['users']['stateus']['errorexits'] = "❌ یک درخواست از قبل ثبت شده است لطفا منتظر بمانید تا درخواست قبلی بررسی سپس درخواست جدید ارسال کنید.";
$textbotlang['users']['stateus']['descriptions_removeservice'] = " با کلیک بر روی دکمه \"✅ درخواست حذف سرویس را دارم\"، درخواست حذف سرویس شما به مدیریت ارسال خواهد شد و پس از بررسی، سرویس شما کنسل خواهد شد.\n\n❌ در صورت تأیید مدیریت، مبلغ مصرفی باقی‌مانده به کیف پول شما واریز خواهد شد.\n\nمتشکریم که از خدمات ما استفاده می‌کنید.";
$textbotlang['users']['stateus']['exitsrequsts'] = "❌ شما یک درخواست ثبت شده دارید منتظر بررسی درخواست ثبت شده باشید بعد از بررسی می توانید درخواست حذف خود را ثبت کنید";
$textbotlang['users']['stateus']['sendrequestsremove'] ="📌 با کلیک بر روی دکمه \"✅ درخواست حذف سرویس را دارم\"، درخواست حذف سرویس شما به مدیریت ارسال خواهد شد و پس از بررسی، سرویس شما کنسل خواهد شد.\n\n❌ در صورت تأیید مدیریت، مبلغ مصرفی باقی‌مانده به کیف پول شما واریز خواهد شد.\n\nمتشکریم که از خدمات ما استفاده می‌کنید.";



$textbotlang['users']['perfectmoney']['getvcode'] = "⭕️ برای  افزایش موجودی  ابتدا کد ووچر پرفکت مانی خود را ارسال کنید";
$textbotlang['users']['perfectmoney']['getvnumber'] = "⭕️ کد ووچر دریافت شد حالا کد فعالسازی را ارسال کنید";
$textbotlang['users']['perfectmoney']['errors'] = "❌  خطایی در بررسی ووچر پیش آمده است برای بررسی مشکل با پشتیبانی در ارتباط باشید";
$textbotlang['users']['perfectmoney']['invalidvcodeorev'] = "❌ ووچر ارسال شده نامعتبر است";
$textbotlang['users']['perfectmoney']['invalidvcode'] = "❌ کد ووچر ارسال شده نامعتبر است";
$textbotlang['users']['perfectmoney']['invalid_ev_number'] = "❌ کد فعالسازی ارسال شده نامعتبر است";





$textbotlang['users']['perfectmoney']['getvcode'] = "⭕️ برای  افزایش موجودی  ابتدا کد ووچر پرفکت مانی خود را ارسال کنید";
$textbotlang['users']['perfectmoney']['getvnumber'] = "⭕️ کد ووچر دریافت شد حالا کد فعالسازی را ارسال کنید";
$textbotlang['users']['perfectmoney']['errors'] = "❌  خطایی در بررسی ووچر پیش آمده است برای بررسی مشکل با پشتیبانی در ارتباط باشید";
$textbotlang['users']['perfectmoney']['invalidvcodeorev'] = "❌ ووچر ارسال شده نامعتبر است";
$textbotlang['users']['perfectmoney']['invalidvcode'] = "❌ کد ووچر ارسال شده نامعتبر است";
$textbotlang['users']['perfectmoney']['invalid_ev_number'] = "❌ کد فعالسازی ارسال شده نامعتبر است";



$textbotlang['users']['Discount']['getcode']  = "💝 برای دریافت موجودی کد هدیه خود را ارسال نمایید";
$textbotlang['users']['Discount']['notcode']  = "❌ کد نامعتبر است";
$textbotlang['users']['Discount']['onecode']  = "⭕️ این کد تنها یک بار قابل استفاده است";
$textbotlang['users']['Discount']['getcodesell']  = "🧑‍💻 کد تخفیف خود را ارسال کنید";
$textbotlang['users']['Discount']['correctcode']  = "🤩 کد تخفیف شما درست بود و مبلغ روی فاکتور شما اعمال شد.";
$textbotlang['users']['Discount']['erorrlimit']  = "❌ محدودیت استفاده از این کد تخفیف به پایان رسیده است";
$textbotlang['users']['Discount']['erorrlimitdiscount']  = "❌ محدودیت استفاده از این کد هدیه به پایان رسیده است";
$textbotlang['users']['Discount']['firstdiscount']  = "❌ این کد تخفیف مخصوص خرید اول است";



#--------------[ other users ]--------------#
$textbotlang['users']['backhome'] = "🏠 بازگشت به منوی اصلی";
$textbotlang['users']['time-Service'] = "⏳ زمان اشتراک";
$textbotlang['users']['Volume-Service'] = "🌐 حجم سرویس";
$textbotlang['users']['selectoption'] = "یک گزینه را انتخاب کنید";
$textbotlang['users']['page']['next'] = "بعدی";
$textbotlang['users']['page']['previous'] = "قبلی";
$textbotlang['users']['Service']['Location'] = "🌏 موقعیت سرویس خود را انتخاب نمایید.";
$textbotlang['users']['config'] = " کانفیگ های شما:";
$textbotlang['users']['Invalid-comment'] = "❌ دستور نامعتبر است ❌";
$textbotlang['users']['selectusername'] = "نام کاربری خود را ارسال نمایید
⚠️ نام کاربری باید بدون کاراکترهای اضافه مانند @ ، فاصله ، خط تیره باشد. 
⚠️ نام کاربری باید انگلیسی باشد";
$textbotlang['users']['invalidusername'] ="❌نام کاربری نامعتبر است
🔄 مجددا نام کاربری خود  را ارسال کنید";



$textbotlang['users']['affiliates']['setpercentage'] = "📌 درصدی که می‌خواهید بعد خرید  به کاربر واریز شود  را ارسال کنید";
$textbotlang['users']['affiliates']['changedpercentage'] = "✅ درصد واریز به کاربر با موفقیت تنظیم شد";
$textbotlang['users']['affiliates']['banner'] = "⭕️ بنر زیرمجموعه گیری خود را ارسال کنید 
❌ بنر باید حتما همراه با عکس باشد";
$textbotlang['users']['affiliates']['affiliatesyou'] = "❌امکان زیرمجموعه شدن با این شناسه کاربری وجود ندارد";
$textbotlang['users']['affiliates']['invalidbanner'] = "❌ بنر ارسال شده نامعتبر است ( بنر حتما باید با عکس ارسال شود)";
$textbotlang['users']['affiliates']['insertbanner'] = "✅ بنر شما با موفقیت ثبت گردید.";
$textbotlang['users']['affiliates']['invalidaffiliates'] = "❌ شما نمی توانید زیر مجموعه خودتان باشید";
$textbotlang['users']['affiliates']['priceDiscount'] = "📌 مبلغی که می‌خواهید که کاربر با هر زیرمجموعه جدید دریافت کند را وارد کنید";
$textbotlang['users']['affiliates']['changedpriceDiscount'] = "✅ مبلغ زیرمجموعه گیری با موفقیت ثبت شد";
$textbotlang['users']['affiliates']['offaffiliates'] = "❌ بخش زیرمجموعه گیری خاموش می باشد";

#--------------[ admin ]--------------#

$textbotlang['Admin']['Back-Admin'] = "به پنل ادمین بازگشتید!";
$textbotlang['Admin']['not-user'] = "کاربری با این شناسه یافت نشد";


$textbotlang['Admin']['channel']['join-channel-on'] = "عضویت اجباری روشن گردید
❌❌  برای کار کردن  عضویت اجباری ربات باید ادمین کانال باشد.";
$textbotlang['Admin']['channel']['join-channel-off'] = "عضویت اجباری خاموش گردید";
$textbotlang['Admin']['channel']['changechannel'] = "برای تنظیم کانال عضویت اجباری لطفا آیدی کانال خود را بدون @ وارد نمایید.
    کانال فعلی شما: @";
$textbotlang['Admin']['channel']['setchannel'] = "🔰 کانال با موفقیت تنظیم گردید.
    برای روشن کردن عضویت اجباری از منوی ادمین دکمه 📣 تنظیم کانال جوین اجباری را بزنید";



$textbotlang['Admin']['manageadmin']['getid'] ="🌟آیدی عددی ادمین را ارسال نمایید";
$textbotlang['Admin']['manageadmin']['addadminset'] ="🥳 ادمین با موفقیت اضافه گردید";
$textbotlang['Admin']['manageadmin']['setrule'] ="⭕️ سطح دسترسی ادمین را ارسال کنید
سطح دسترسی administrator به تمامی بخش ها دسترسی دارد
سطح دسترسی Seller فقط به بخش های تایید رسید  ، خدمات کاربر ، آمار ربات دسترسی دارید
سطح دسترسی support به بخش های خدمات کاربر ، پاسخ پیام پشتیبانی دسترسی دارد";
$textbotlang['Admin']['manageadmin']['removedadmin'] ="✅ ادمین با موفقیت حذف گردید.";
$textbotlang['Admin']['manageadmin']['invalidrule'] ="❌ سطح دسترسی نامعتبر";




$textbotlang['Admin']['manageusertest']['getidlimit'] = " ⚜️ آیدی عددی کاربر را ارسال کنید
توضیحات: در این بخش میتوانید محدودیت ساخت اکانت تست را برای کاربر تغییر دهید. بطور پیشفرض محدودیت ساخت عدد 1 است.";
$textbotlang['Admin']['getlimitusertest']['getid'] = "آیدی عددی دریافت شد لطفا تعداد ساخت اکانت تست را ارسال کنید";
$textbotlang['Admin']['getlimitusertest']['setlimit'] = "محدودیت برای کاربر تنظیم گردید.";
$textbotlang['Admin']['getlimitusertest']['limitall'] = "تعداد ساخت اکانت تست را وارد نمایید.";
$textbotlang['Admin']['getlimitusertest']['setlimitall'] = "محدودیت ساخت اکانت برای تمام کاربران تنظیم شد";

$textbotlang['Admin']['sumuser'] = "👤 تعداد کاربران";
$textbotlang['Admin']['sumusertest'] = "🖥 مجموع اکانت تست";
$textbotlang['Admin']['phpversion'] = "👨‍💻 نسخه php هاست";
$textbotlang['Admin']['pingbot'] = "🚀 پینگ ربات";
$textbotlang['Admin']['sellservices'] = "🛍 فروش کل ";
$textbotlang['Admin']['dayListSell'] = "☀️ فروش امروز";
$textbotlang['Admin']['Balanceall'] = "💰 موجودی کل کاربران";
$textbotlang['Admin']['sumporoduct'] = "🛍 جمع کل سفارشات";


$textbotlang['Admin']['managepanel']['selectpanel'] = "پنل خود را انتخاب کنید";
$textbotlang['Admin']['managepanel']['connectx-ui'] = "✅ پنل متصل است";
$textbotlang['Admin']['managepanel']['errorstateuspanel'] = "امکان اتصال به پنل  وجود ندارد 😔
            
⭕️ در صورت وارد کردن دامنه طبق شرایط اعلام شده  این خطا بدلیل  بسته بودن خروجی پورت پنل روی هاست ربات اتفاق می افتد.
    
راه حل اول : پورت پنل را به پورت های 443 یا 8080 تغییر دهید این پورت ها  همیشه باز هستند
⚠️ اگر پنل پورت 443 است  گاهی با پورت 443 کار میکند گاهی بدون پورت 
راه حل دوم : به پشتیبانی هاستینگ تیکت داده و اعلام کنید پورت پنل تان را باز کنند روی سرور";
$textbotlang['Admin']['managepanel']['addpanelname']= "برای اضافه کردن پنل  به ربات ابتدا یک نام برای پنل خود ارسال کنید
                
⚠️ توجه: نام پنل نامی است که  در هنگام انجام عملیات جستجو  نشان داده می شود.";
$textbotlang['Admin']['managepanel']['addpanelurl'] = "🔗 نام پنل ذخیره شد حالا آدرس پنل خود ارسال کنید
    ⚠️ توجه:
    🔸 آدرس پنل باید بدون dashboard ارسال شود.
    🔹 در صورتی که پورت پنل 443 است پورت را نباید وارد کنید.  ( گاهی حتما با پورت باید وارد کنید)
    🔸 آخر آدرس نباید / داشته باشد
    🔹 در صورت وارد کردن آیپی حتما http یا https باید داشته باشد";
$textbotlang['Admin']['managepanel']['Invalid-domain'] = "🔗 آدرس دامنه نامعتبر است";
$textbotlang['Admin']['managepanel']['usernameset'] ="👤 آدرس پنل ذخیره شد حالا نام کاربری  را ارسال کنید";
$textbotlang['Admin']['managepanel']['getpassword'] = "🔑  رمز عبور پنل  خود را وارد نمایید";
$textbotlang['Admin']['managepanel']['addedpanel'] = "تبریک پنل شما با موفقیت اضافه گردید";
$textbotlang['Admin']['managepanel']['GetRemoveNamePanel'] = "پنلی که میخواهید حذف کنید را انتخاب کنید.";
$textbotlang['Admin']['managepanel']['RemovedPanel'] = "پنل با موفقیت حذف گردید";
$textbotlang['Admin']['managepanel']['nullpanel'] = "⭕️ موقعیتی یافت نشد برای رفع مشکل با پشتیبانی در ارتباط باشید";
$textbotlang['Admin']['managepanel']['nullpaneladmin'] = "پنل تعریف نشده است ابتدا پنل را تعریف کنید سپس محصول اضافه کنید";
$textbotlang['Admin']['managepanel']['getloc'] = "برای ویرایش پنل نام پنل را ارسال کنید";
$textbotlang['Admin']['managepanel']['GetNameNew'] = "نام جدید پنل را  ارسال کنید";
$textbotlang['Admin']['managepanel']['ChangedNmaePanel'] = "✅ نام پنل با موفقیت تغییر کرد.";
$textbotlang['Admin']['managepanel']['geturlnew'] = " آدرس جدید پنل را  ارسال کنید";
$textbotlang['Admin']['managepanel']['ChangedurlPanel'] = "✅ آدرس پنل با موفقیت تغییر کرد.";
$textbotlang['Admin']['managepanel']['Repeatpanel'] = "❌ نام پنل از قبل ثبت شده دوباره نمی توانید ثبت کنید";
$textbotlang['Admin']['managepanel']['customnamesend'] = "متن دلخواه خود را ارسال کنید";
$textbotlang['Admin']['managepanel']['invalidname'] = "نام نامعتبر است";
$textbotlang['Admin']['managepanel']['savedname'] = "✅ نام  با موفقیت ذخیره شد";
$textbotlang['Admin']['managepanel']['getusernamenew'] = " نام کاربری جدید پنل را  ارسال کنید";
$textbotlang['Admin']['managepanel']['ChangedusernamePanel'] = "✅ نام کاربری پنل با موفقیت تغییر کرد.";
$textbotlang['Admin']['managepanel']['getpasswordnew'] = "رمز عبور جدید پنل را ارسال کنید";
$textbotlang['Admin']['managepanel']['ChangedpasswordPanel'] = "✅ رمز عبور پنل با موفقیت تغییر کرد.";





$textbotlang['Admin']['ManageUser']['SendMessageuser'] = "✅ پیام با موفقیت برای کاربر ارسال گردید.";
$textbotlang['Admin']['ManageUser']['GetTextResponse'] = "برای پاسخ به کاربر متن خود را ارسال کنید.";
$textbotlang['Admin']['ManageUser']['GetText'] = "متن خود را ارسال کنید";
$textbotlang['Admin']['ManageUser']['ForwardGetext'] = "متن فورواردی خود را ارسال کنید";
$textbotlang['Admin']['ManageUser']['ForwardSendAllUser'] = "✅ پیام برای تمامی کاربران فوروارد شد.";
$textbotlang['Admin']['ManageUser']['MessageSent'] = "✅ پیام ارسال شد";
$textbotlang['Admin']['ManageUser']['ChangeTextGet'] = " متن جدید خود را ارسال کنید.
متن فعلی :";
$textbotlang['Admin']['ManageUser']['GetIDMessage'] = "✅ متن دریافت شد حالا آیدی عددی کاربر را ارسال کنید.";
$textbotlang['Admin']['ManageUser']['ErrorText'] = "فقط متن می توانید ارسال کنید";
$textbotlang['Admin']['ManageUser']['SaveText'] = "✅ متن با موفقیت ذخیره شد";
$textbotlang['Admin']['ManageUser']['BlockUserId'] = "👤 آیدی عددی کاربر را ارسال کنید";
$textbotlang['Admin']['ManageUser']['BlockedUser'] = "کاربر از قبل بلاک بوده است❗️";
$textbotlang['Admin']['ManageUser']['BlockUser'] = "🚫 کاربر مسدود شد حالا دلیل مسدودی هم ارسال کنید.";
$textbotlang['Admin']['ManageUser']['RemoveService'] = "در این بخش می توانید  سرویسی  داخل ربات حذف نمایید.
برای حذف سرویس نام کاربری که داخل پنل ثبت شده بود را ارسال نمایید";
$textbotlang['Admin']['ManageUser']['RemovedService'] = "✅ سرویس کاربر حذف گردید.";
$textbotlang['Admin']['ManageUser']['DescriptionBlock'] = "✍️ دلیل مسدودی کاربر ذخیره شد";
$textbotlang['Admin']['ManageUser']['GetIdUserunblock'] = "👤 آیدی عددی کاربر را ارسال کنید";
$textbotlang['Admin']['ManageUser']['UserNotBlock'] = "کاربر بلاک نیست 😐";
$textbotlang['Admin']['ManageUser']['UserUnblocked'] = "کاربر از حالت مسدودی خارج گردید. 🤩";
$textbotlang['Admin']['ManageUser']['Acceptedphone'] = "تایید شده";
$textbotlang['Admin']['ManageUser']['Failedphone'] = "تایید نشده";
$textbotlang['Admin']['ManageUser']['Userid'] = "🔵 آیدی عددی کاربر";
$textbotlang['Admin']['ManageUser']['LimitUsertest'] = "🔵 محدودیت اکانت تست";
$textbotlang['Admin']['ManageUser']['rollUser'] = "🔵 وضعیت تایید قانون";
$textbotlang['Admin']['ManageUser']['PhoneUser'] = "🔵 شماره موبایل";
$textbotlang['Admin']['ManageUser']['BalanceUser'] = "🔵 موجودی کابر";
$textbotlang['Admin']['ManageUser']['ViewInfo'] = "👀 اطلاعات کاربر: ";
$textbotlang['Admin']['ManageUser']['ViewOrder'] = "👁 برای مشاهده سفارشات کاربر آیدی عددی کاربر را ارسال کنید";
$textbotlang['Admin']['ManageUser']['dataorder'] = " تاریخ ثبت نشده است";
$textbotlang['Admin']['ManageUser']['SendOrder'] = "لیست سفارشات کاربر ارسال شد";
$textbotlang['Admin']['ManageUser']['mangebtnuser'] = "⚙️ مدیریت کاربر";
$textbotlang['Admin']['ManageUser']['mangebtnuserdec'] = "⭕️ در این بخش میتوانید تمام کاربران را مشاهده کنید 
⚠️ برای مدیریت کاربر روی دکمه مدیریت کاربر جلوی هر کاربر بزنید";
$textbotlang['Admin']['ManageUser']['backlistuser'] = "🏠 بازگشت به لیست کاربران";
$textbotlang['Admin']['ManageUser']['addbalanceuser'] = "👆افزایش موجودی";
$textbotlang['Admin']['ManageUser']['lowbalanceuser'] = "👇 کم کردن موجودی";
$textbotlang['Admin']['ManageUser']['addbalanceuserdec'] = "⭕️ مبلغی که میخواهید اضافه کنید را ارسال کنید";
$textbotlang['Admin']['ManageUser']['lowbalanceuserdec'] = "⭕️ مبلغی که میخواهید کسر کنید را ارسال کنید";
$textbotlang['Admin']['ManageUser']['addbalanced'] = "✅ موجودی با موفقیت به حساب کاربر افزوده شد.";
$textbotlang['Admin']['ManageUser']['lowbalanced'] = "✅ موجودی با موفقیت از حساب کاربر کم شد.";
$textbotlang['Admin']['Balance']['AddBalanceUsers'] = "✅ مبلغ به موجودی کاربران اضافه شد";
$textbotlang['Admin']['ManageUser']['banuserlist'] = "🔒 مسدود کردن کاربر";
$textbotlang['Admin']['ManageUser']['unbanuserlist'] = "🔓 رفع مسدودی کاربر";
$textbotlang['Admin']['ManageUser']['confirmnumber'] = "تایید دستی شماره تلفن";
$textbotlang['Admin']['ManageUser']['vieworderuser'] = "🛍 مشاهده سفارشات کاربر";
$textbotlang['Admin']['ManageUser']['viewpaymentuser'] = "💰 مشاهده پرداختی های کاربر";
$textbotlang['Admin']['ManageUser']['sendpayemntlist'] = "✅ لیست پرداختی های کاربر ارسال شد";
$textbotlang['Admin']['ManageUser']['removeservice'] = "❌ حذف سفارش";
$textbotlang['Admin']['ManageUser']['removeserviceandback'] = "❌ حذف سفارش و بازگشت مبلغ";






$textbotlang['Admin']['Help']['GetAddNameHelp'] ="برای اضافه کردن آموزش یک نام ارسال کنید 
⚠️ توجه: نام آموزش نامی است که کاربر در لیست مشاهده می کند.";
$textbotlang['Admin']['Help']['GetAddDecHelp'] = " 🔗 نام آموزش ذخیره شد حالا توضیحات خود را ارسال کنید 
⚠️ توجه:
🔸 توضیحات میتوانید همراه با عکس یا فیلم ارسال کنید";
$textbotlang['Admin']['Help']['SaveHelp'] = "✅ آموزش با موفقیت ذخیره شد";
$textbotlang['Admin']['Help']['SelectName'] = "نام آموزش را انتخاب کنید";
$textbotlang['Admin']['Help']['RemoveHelp'] = "✅ آموزش حذف گردید.";




$textbotlang['Admin']['Status']['btn'] ="📈 آمار ربات شما";
$textbotlang['Admin']['Status']['subject'] = "عنوان";
$textbotlang['Admin']['Status']['statussubject'] = "وضعیت";
$textbotlang['Admin']['Status']['statuson'] = "✅ روشن";
$textbotlang['Admin']['Status']['statusoff'] = "❌ خاموش";
$textbotlang['Admin']['Status']['BotTitle'] = "📌  در این بخش می توانید مشخص کنید که قابلیت های زیر فعال باشند یا خیر.";
$textbotlang['Admin']['Status']['stautsbot'] = "📡 وضعیت ربات";
$textbotlang['Admin']['Status']['onhold'] = "وضعیت قابلیت اولین اتصال سرویس";
$textbotlang['Admin']['Status']['onstatus'] = "روشن شد";
$textbotlang['Admin']['Status']['offstatus'] = "خاموش شد";
$textbotlang['Admin']['Status']['subTitle'] = "در این قسمت می توانید تنظیم کنید که کاربر بعد از خرید لینک سابسکرایبشن دریافت کند یا نه";
$textbotlang['Admin']['Status']['subStatusOff'] = "⭕️ ارسال لینک اشتراک غیرفعال گردید. از این پس کاربر پس از خرید لینک سابسکرایب دریافت نخواهد کرد.";
$textbotlang['Admin']['Status']['subStatuson'] = "لینک سابسکرایب فعال گردید. از این پس کاربر پس خرید لینک سابسکرایب دریافت خواهد کرد";
$textbotlang['Admin']['Status']['configTitle'] = "در این قسمت می توانید تعیین کنید که بعد از خرید کاربر کانفیگ های دستی دریافت کند یا خیر";
$textbotlang['Admin']['Status']['configStatusOff'] = "⭕️ ارسال کانفیگ دستی غیرفعال گردید. از این پس کاربر پس از خرید  کانفیگ دستی دریافت نخواهد کرد.";
$textbotlang['Admin']['Status']['configStatuson'] = "ارسال کانفیگ بعد خرید فعال شد از این پس کاربران کانفیگ دستی هم دریافت خواهند کرد";
$textbotlang['Admin']['Status']['cardTitle'] = "در این بخش می توانید درگاه آفلاین را خاموش یا روشن کنید";
$textbotlang['Admin']['Status']['cardStatusOff'] = "⭕ وضعیت درگاه آفلاین خاموش گردید";
$textbotlang['Admin']['Status']['cardStatuson'] = "وضعیت درگاه آفلاین روشن گردید";
$textbotlang['Admin']['Status']['nowpaymentsTitle'] = "در این بخش می توانید درگاه نیوپیمنت  را فعال یا غیرفعال کنید";
$textbotlang['Admin']['Status']['nowpaymentsStatusOff'] = "⭕ وضعیت درگاه  خاموش گردید";
$textbotlang['Admin']['Status']['nowpaymentsStatuson'] = "وضعیت درگاه  روشن گردید";
$textbotlang['Admin']['Status']['digiTitle'] = "در این بخش می توانید درگاه سواپینو  را فعال یا غیرفعال کنید";
$textbotlang['Admin']['Status']['digiStatusOff'] = "⭕ درگاه  خاموش گردید";
$textbotlang['Admin']['Status']['digiStatuson'] = "درگاه  روشن گردید";
$textbotlang['Admin']['Status']['zarinpalTitle'] = "در این بخش می توانید درگاه زرین پال را فعال یا غیرفعال کنید";
$textbotlang['Admin']['Status']['zarrinpalStatusOff'] = "⭕ درگاه  خاموش گردید";
$textbotlang['Admin']['Status']['zarinpalStatuson'] = "درگاه  روشن گردید";
$textbotlang['Admin']['Status']['aqayepardakhtTitle'] = "در این بخش می توانید درگاه آقای پرداخت  را فعال یا غیرفعال کنید";
$textbotlang['Admin']['Status']['aqayepardakhtStatusOff'] = "⭕ درگاه  خاموش گردید";
$textbotlang['Admin']['Status']['aqayepardakhtStatuson'] = "درگاه  روشن گردید";
$textbotlang['Admin']['Status']['perfectmoneyTitle'] = "در این بخش می توانید درگاه پرفکت مانی را فعال یا غیرفعال کنید";
$textbotlang['Admin']['Status']['perfectmoneyStatusOff'] = "⭕ درگاه  خاموش گردید";
$textbotlang['Admin']['Status']['perfectmoneyStatuson'] = "درگاه  روشن گردید";
$textbotlang['Admin']['Status']['perfectmoneyTitle'] = "در این بخش می توانید درگاه پرفکت مانی را فعال یا غیرفعال کنید";
$textbotlang['Admin']['Status']['perfectmoneyStatusOff'] = "⭕ درگاه  خاموش گردید";
$textbotlang['Admin']['Status']['perfectmoneyStatuson'] = "درگاه  روشن گردید";
$textbotlang['Admin']['Status']['affiliates'] = "📌 در این بخش می توانید قابلیت زیر مجموعه گیری در ربات را خاموش یا روشن کنید";
$textbotlang['Admin']['Status']['affiliatesStatusOff'] = "قابلیت زیرمجموعه گیری غیرفعال شد";
$textbotlang['Admin']['Status']['affiliatesStatuson'] = "قابلیت زیر مجموعه روشن شد";
$textbotlang['Admin']['Status']['commission'] = "وضعیت فعال بودن قابلیت هدیه بعد از استارت ربات";
$textbotlang['Admin']['Status']['commissionStatusOff'] = "قابلیت پورسانت غیرفعال شد";
$textbotlang['Admin']['Status']['commissionStatuson'] = "قابلیت پورسانت فعال شد";
$textbotlang['Admin']['Status']['Discountaffiliates'] = "وضعیت فعال بودن قابلیت هدیه";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatusOff'] = "قابلیت هدیه غیرفعال شد";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatuson'] = "قابلیت هدیه فعال شد";
$textbotlang['Admin']['Status']['notusenameinbot'] = "🔍 نام کاربری من در لیست نیست";


$textbotlang['Admin']['phone']['notactive'] = "🛑شماره موبایل تایید نشده است🛑";
$textbotlang['Admin']['phone']['active'] = "شماره موبایل کاربر تایید شده است ✅🎉";
$textbotlang['Admin']['phone']['NotSend'] = "کاربر شماره موبایل خود را ارسال نکرده است";



$textbotlang['Admin']['Channel']['ReportChannel'] = "📣در این بخش میتوانید آیدی عددی کانال یا گروه را برای ارسال اعلان ارسال نمایید
برای دریافت آیدی عددی کانال می توانید پیامی داخل کانال ارسال کرده و پیام ارسال شده را برای آیدی زیر فوروارد کنید تا ایدی عددی دریافت کنید.
برای گروه هم میتوانید ربات را اد کرده و دستور ارسال ایدی ارسال کنید تا آیدی عددی گروه را دیافت کنید
        @myidbot
آیدی عددی فعلی شما:";
$textbotlang['Admin']['Channel']['SetChannelReport'] ="🔰 کانال با موفقیت تنظیم گردید";
$textbotlang['Admin']['Channel']['TestChannel'] = "تست ارسال کانال گزارش";

$textbotlang['Admin']['Product']['Service_location'] ="📌 موقعیت محصول خود را انتخاب کنید

 ⭕️ برای تعریف محصول در همه موقعیت ها دستور /all را ارسال کنید";
$textbotlang['Admin']['Product']['nullpProduct']   = "⭕️ محصولی یافت نشد برای رفع مشکل با پشتیبانی در ارتباط باشید";
$textbotlang['Admin']['Product']['Rmove_location'] ="📌 موقعیت محصول خود را انتخاب کنید";
$textbotlang['Admin']['Product']['selectRemoveProduct'] ="محصولی که میخوای حذف کنی ر و انتخاب کن";
$textbotlang['Admin']['Product']['selectEditProduct'] ="محصولی که میخوای ویرایش کنی رو انتخاب کن";
$textbotlang['Admin']['Product']['selectfieldProduct'] ="فیلدی که مخیواهید ویرایش کنید را انتخاب کنید";
$textbotlang['Admin']['Product']['RemoveedProduct'] ="✅ محصول با موفقیت حذف گردید.";
$textbotlang['Admin']['Product']['AddProductStepOne'] = " ابتدا نام اشتراک خود را ارسال نمایید
⚠️ نکات هنگام وارد کردن ام محصول:
• در کنار نام اشتراک حتما قیمت اشتراک را هم وارد کنید.
• در کنار نام اشتراک حتما زمان اشتراک را هم وارد کنید.";
$textbotlang['Admin']['Product']['GetLimit'] = "حجم اشتراک را ارسال کنید توجه واحد حجم گیگابایت است

اگر میخواهید حجم نامحدود باشد عدد 0 ارسال کنید";
$textbotlang['Admin']['Product']['Getcategory'] = "دسته بندی محصول را انتخاب کنید";
$textbotlang['Admin']['Product']['Invalidvolume'] = "حجم نامعتبر است";
$textbotlang['Admin']['Product']['GettIime'] = "
زمان اشتراک را وارد نمایید توجه زمان واحد زمان اشتراک روز است
اگر می خواهید زمان نامحدود باشد عدد 0 را ارسال کنید";
$textbotlang['Admin']['Product']['InvalidTime'] = "زمان نامعتبر است";
$textbotlang['Admin']['Product']['GetPrice'] = "
قمیت اشتراک  را ارسال کنید.
توجه: 
محصول براساس تومان است و قیمت را بدون هیچ کاراکتر اضافی ارسال نمایید.";
$textbotlang['Admin']['Product']['InvalidPrice'] = "قیمت نامعتبر است";
$textbotlang['Admin']['Product']['SaveProduct'] = "محصول با موفقیت ذخیره شد 🥳🎉";
$textbotlang['Admin']['Product']['volumeUpdated'] = "✅ حجم محصول بروزرسانی شد";
$textbotlang['Admin']['Product']['TimeUpdated'] = "✅ زمان محصول بروزرسانی شد";
$textbotlang['Admin']['Product']['NewTime'] = "زمان جدید را ارسال کنید";


$textbotlang['Admin']['Payment']['reviewedpayment'] = "❌ این پرداخت قبلا توسط ادمین دیگری بررسی شده است";
$textbotlang['Admin']['Payment']['Reasonrejecting'] = "دلیل رد کردن پرداخت را ارساال نمایید";
$textbotlang['Admin']['Payment']['Rejected'] = "⭕️ پرداخت با موفقیت رد گردید و به کاربر پیام ارسال شد";


$textbotlang['Admin']['Usertest']['TimeUpdated'] = "✅ زمان سرویس تست بروزرسانی شد";
$textbotlang['Admin']['Usertest']['VolumeUpdated'] = "✅ حجم سرویس تست بروزرسانی شد";


$textbotlang['Admin']['Balance']['PriceBalance'] = "آیدی عددی دریافت شد مبلغی که میخواهید به کاربر اضافه کنید را ارسال کنید مبلغ به تومان باشد";
$textbotlang['Admin']['Balance']['PriceBalancek'] = "آیدی عددی دریافت شد مبلغی که میخواهید از کاربرکم کنید را ارسال کنید مبلغ به تومان باشد";
$textbotlang['Admin']['Balance']['Invalidprice'] = "مبلغ نامعتبر است";
$textbotlang['Admin']['Balance']['AddBalanceUser'] = "✅ مبلغ به موجودی کاربر اضافه شد";
$textbotlang['Admin']['Balance']['NegativeBalanceUser'] = "✅ مبلغ از موجودی کاربر کسر شد";
$textbotlang['Admin']['Balance']['addallbalance'] = "📌 مبلغ را برای شارژ همگانی ارسال نمایید";




$textbotlang['Admin']['Discount']['GetCode'] ="کدی را برای کدهدیه ارسال کنید";
$textbotlang['Admin']['Discount']['ErrorCode'] ="کد نامعتبر است کد باید حتما انگلیسی بدون کاراکتر اضافی باشد";
$textbotlang['Admin']['Discount']['PriceCode'] ="کد دریافت شد حالا مبلغ کد  رو بفرست";
$textbotlang['Admin']['Discount']['SaveCode'] ="✅  کد با موفقیت ثبت گردید";
$textbotlang['Admin']['Discount']['RemoveCode'] ="کد که میخوای حذف کنی رو انتخاب کن";
$textbotlang['Admin']['Discount']['RemovedCode'] ="✅ کد  با موفقیت حذف گردید.";
$textbotlang['Admin']['Discount']['NotCode'] = "❌ خطا 
📝 کد هدیه انتخابی وجود ندارد";




$textbotlang['Admin']['Protocol']['Title'] = "در این بخش می توانید تعیین کنید که به مشتری چه پروتکل هایی داده شود.
📨 برای اضافه کردن پروتکل از لیست زیر پروتکل خود را ارسال کنید";
$textbotlang['Admin']['Protocol']['invalidProtocol'] = "❌ پروتکل نامعتبر";
$textbotlang['Admin']['Protocol']['AddedProtocol'] = "✅ پروتکل اضافه شد.";
$textbotlang['Admin']['Protocol']['RemoveProtocol'] = "پروتکلی که میخواهید حذف کنید را انتخاب کنید.";
$textbotlang['Admin']['Protocol']['RemovedProtocol'] = "پروتکل با موفقیت حذف گردید.";



$textbotlang['Admin']['AlgortimeUsername']['SaveData'] = "✅روش ساخت نام کاربری با موفقیت آپدیت شد";



$textbotlang['Admin']['SettingPayment']['Savacard'] = "✅ شماره کارت شما با موفقیت ثبت شد.";
$textbotlang['Admin']['SettingnowPayment']['Savaapi'] = "✅ تغییرات  با موفقیت ثبت شد";

$textbotlang['Admin']['perfectmoney']['setnumberacount'] = "✅ شماره اکانت با موفقیت ثبت شد";


$textbotlang['Admin']['Discountsell']['GetCode'] ="کدی را برای کد تخفیف ارسال کنید";
$textbotlang['Admin']['Discountsell']['getlimit'] ="محدودیت استفاده برای کاربر را ارسال کنید";
$textbotlang['Admin']['Discount']['PriceCodesell'] ="کد دریافت شد حالا درصد کد  را بفرست";
$textbotlang['Admin']['Discount']['invalidcodedis'] ="❌  کد تخفیف نامعتبر است";


$textbotlang['Admin']['mesage']['nottextmessage'] ="❌  در ارسال همگانی فقط متن می توانید ارسال نمایید.";
>>>>>>> main
